doc/s-sql-w.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 19:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples W</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples W</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8c6bd3c">S-SQL Examples Home Page</a></li>
<li><a href="#when">When</a></li>
<li><a href="#window">Window</a></li>
<li><a href="#with">With</a></li>
<li><a href="#with-recursive">With-recursive</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org8c6bd3c" class="outline-2">
<h2 id="org8c6bd3c"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org8c6bd3c">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-when" class="outline-2">
<h2 id="when">When</h2>
<div class="outline-text-2" id="text-when">
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((param-latitude nil) (param-longitude t))
  (query (<span class="org-builtin">:select</span> 'id 'name
                  (<span class="org-keyword">when</span> param-latitude '0)
                  (<span class="org-keyword">when</span> param-longitude 'longitude)
                  <span class="org-builtin">:from</span> 'countries
                  <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id 20))))

((20 <span class="org-string">"UK"</span> NIL -2))
</pre>
</div>
</div>
</div>

<div id="outline-container-window" class="outline-2">
<h2 id="window">Window</h2>
<div class="outline-text-2" id="text-window">
<p>
As stated in the postgresql documentation: "When a query involves multiple window functions, it is possible to write out each one with a separate OVER clause, but this is duplicative and error-prone if the same windowing behavior is wanted for several functions. Instead, each windowing behavior can be named in a WINDOW clause and then referenced in OVER". <a href="http://www.postgresql.org/docs/9.1/static/tutorial-window.html">http://www.postgresql.org/docs/9.1/static/tutorial-window.html</a>. They are available in postmodern as of the 29 October 2013 additions to the git repository.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:over</span> (<span class="org-builtin">:sum</span> 'salary) 'w)
                (<span class="org-builtin">:over</span> (<span class="org-builtin">:avg</span> 'salary) 'w)
                <span class="org-builtin">:from</span> 'empsalary <span class="org-builtin">:window</span>
                (<span class="org-builtin">:as</span> 'w (<span class="org-builtin">:partition-by</span> 'depname <span class="org-builtin">:order-by</span> (<span class="org-builtin">:desc</span> 'salary)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-with" class="outline-2">
<h2 id="with">With</h2>
<div class="outline-text-2" id="text-with">
<p>
With queries are often referred to as Common Table Expressions. They are used as ways to write auxiliary statements for use in a larger query. The Postgresql documentation covers them at <a href="http://www.postgresql.org/docs/current/queries-with.html">http://www.postgresql.org/docs/current/queries-with.html</a>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (<span class="org-builtin">:with</span>
  (<span class="org-builtin">:as</span> 'upd
       (<span class="org-builtin">:parens</span>
        (<span class="org-builtin">:update</span> 'employees
         <span class="org-builtin">:set</span> 'sales-count (<span class="org-builtin">:=</span> 'sales-count 1)
                 <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id
                            (<span class="org-builtin">:select</span> 'sales-person
                             <span class="org-builtin">:from</span> 'accounts
                             <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'name <span class="org-string">"Acme Corporation"</span>)))
                 <span class="org-builtin">:returning</span> '*)))
  (<span class="org-builtin">:insert-into</span> 'employees-log
                (<span class="org-builtin">:select</span> '* 'current-timestamp
                         <span class="org-builtin">:from</span>
                         'upd))))
</pre>
</div>
</div>
</div>

<div id="outline-container-with-recursive" class="outline-2">
<h2 id="with-recursive">With-recursive</h2>
<div class="outline-text-2" id="text-with-recursive">
<p>
With-recursive allows the with auxiliary statement to refer to itself. These queries match the following template:
</p>
<div class="org-src-container">
<pre class="src src-text">WITH RECURSIVE [temp table] [column list]
AS (   [seed statement]
UNION ALL   [recursive statement - effectively looping through the table] )

[outer query which specifies the fields to be kept in the final result and throws away the intermediate results]

</pre>
</div>
<p>
Testing with recursive. When working with recursive queries it is important to be sure that the recursive part of the query will eventually return no tuples, or else the query will loop indefinitely. Sometimes, using UNION instead of UNION ALL can accomplish this by discarding rows that duplicate previous output rows. However, often a cycle does not involve output rows that are completely duplicate: it may be necessary to check just one or a few fields to see if the same point has been reached before. The standard method for handling such situations is to compute an array of the already-visited values.
</p>

<p>
A few postmodern samples follow which match up with the <a href="https://www.postgresql.org/docs/current/queries-with.html">postgresql documentation examples:</a>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (<span class="org-keyword">:with-recursive</span>
     (<span class="org-builtin">:as</span> (<span class="org-builtin">:t1</span> 'n)
          (<span class="org-builtin">:union-all</span> (<span class="org-builtin">:values</span> (<span class="org-builtin">:set</span> 1))
                      (<span class="org-builtin">:select</span> (<span class="org-builtin">:+</span> 'n 1)
                       <span class="org-builtin">:from</span> 't1
                       <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'n 100))))
   (<span class="org-builtin">:select</span> (<span class="org-builtin">:sum</span> 'n) <span class="org-builtin">:from</span> 't1))
 <span class="org-builtin">:single</span>))

(query
 (<span class="org-keyword">:with-recursive</span>
     (<span class="org-builtin">:as</span> (<span class="org-builtin">:included-parts</span> 'sub-part 'part 'quantity)
          (<span class="org-builtin">:union-all</span>
           (<span class="org-builtin">:select</span> 'sub-part 'part 'quantity
            <span class="org-builtin">:from</span> 'parts
            <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'part <span class="org-string">"our-product"</span>))
           (<span class="org-builtin">:select</span> 'p.sub-part 'p.part 'p.quantity
            <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'included-parts 'pr)
                    (<span class="org-builtin">:as</span> 'parts 'p)
                    <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'p.part 'pr.sub-part))))
   (<span class="org-builtin">:select</span> 'sub-part (<span class="org-builtin">:as</span> (<span class="org-builtin">:sum</span> 'quantity) 'total-quantity)
            <span class="org-builtin">:from</span> 'included-parts
            <span class="org-builtin">:group-by</span> 'sub-part)))


(query
 (<span class="org-keyword">:with-recursive</span>
     (<span class="org-builtin">:as</span> (<span class="org-builtin">:search-graph</span> 'id 'link 'data 'depth)
          (<span class="org-builtin">:union-all</span>
           (<span class="org-builtin">:select</span> 'g.id 'g.link 'g.data 1
                    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'graph 'g))
           (<span class="org-builtin">:select</span> 'g.id 'g.link 'g.data (<span class="org-builtin">:=</span> 'sg.depth 1)
                    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'graph 'g) (<span class="org-builtin">:as</span> 'search-graph 'sg)
            <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'g.id 'sg.link))))
   (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'search-graph)))

(query
 (<span class="org-keyword">:with-recursive</span>
     (<span class="org-builtin">:as</span> (<span class="org-builtin">:search-graph</span> 'id 'link 'data'depth 'path 'cycle)
          (<span class="org-builtin">:union-all</span>
           (<span class="org-builtin">:select</span> 'g.id 'g.link 'g.data 1
                    (<span class="org-builtin">:[]</span> 'g.f1 'g.f2) nil
                    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'graph 'g))
           (<span class="org-builtin">:select</span> 'g.id 'g.link 'g.data (<span class="org-builtin">:=</span> 'sg.depth 1)
                    (:|| 'path (<span class="org-builtin">:row</span> 'g.f1 'g.f2))
                    (<span class="org-builtin">:=</span> (<span class="org-builtin">:row</span> 'g.f1 'g.f2)
                        (<span class="org-builtin">:any*</span> 'path))
                    <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'graph 'g)
                    (<span class="org-builtin">:as</span> 'search-graph 'sg)
            <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'g.id 'sg.link)
                         (<span class="org-builtin">:not</span> 'cycle)))))
   (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'search-graph)))

</pre>
</div>

<p>
As a different example, consider a quicklisp dependency table where the fields are 'depends_on' and 'depended_on'. In other words library staple depends-on alexandria. So one record has "staple" in the depends_on column and "alexandria" in the depended_on column.
</p>

<p>
A function to return a list of all the dependencies of a quicklisp library (assuming the data is in a table called "dependencies") could look like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">list-dependencies</span> (lib-name)
  <span class="org-doc">"Returns a list of the names of the direct and indirect libraries depended-on by lib-name."</span>
  (sort (alexandria:flatten
           (postmodern:query
            (<span class="org-keyword">:with-recursive</span>
            (<span class="org-builtin">:as</span> 'children
                 (<span class="org-builtin">:union</span>
                  (<span class="org-builtin">:select</span> 'depended-on
                           <span class="org-builtin">:from</span> 'dependencies
                           <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'depends-on '$1))
                  (<span class="org-builtin">:select</span> 'a.depended-on
                           <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'dependencies 'a)
                           <span class="org-builtin">:inner-join</span> (<span class="org-builtin">:as</span> 'children 'b)
                           <span class="org-builtin">:on</span> (<span class="org-builtin">:=</span> 'a.depends-on 'b.depended-on))))
            (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'children))
            lib-name))
      #'string&lt;)))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>